[{"author": "checklistmaker", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_11ymxu", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546739081, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ad0xs1/is_my_strategy_stupid_or_smart/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "ad0xs1", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 46, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ad0xs1/is_my_strategy_stupid_or_smart/", "pinned": false, "pwls": 6, "retrieved_on": 1546739081, "score": 1, "selftext": "I’m a  rookie level  “trader” with a margin account. My new strategy is to wake up and watch futures. If futures look good I buy a few stocks in the morning and get out within an hour or two. I have not kept money in the market overnight.\n\nI think I can make $500 or so a day with $50 or so in fees.\n\nPlease be brutal. Is this stupid or smart?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309477, "subreddit_type": "public", "thumbnail": "self", "title": "Is my strategy stupid or smart?", "url": "https://www.reddit.com/r/stocks/comments/ad0xs1/is_my_strategy_stupid_or_smart/", "whitelist_status": "all_ads", "wls": 6}, {"author": "gorillaz0e", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_hmrfu", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546690749, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/actp7h/all_index_futures_are_3/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "actp7h", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 51, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/actp7h/all_index_futures_are_3/", "pinned": false, "pwls": 6, "retrieved_on": 1546690749, "score": 1, "selftext": "All futures are very, very green right now:\nhttps://finviz.com/futures.ashx\n\nis the correction over?\n\nStocks bolted out of the starting gate Friday on positive news from China and stronger-than-expected December payrolls data, and ahead of comments from the Federal Reserve chairman Jerome Powell.\n\nChip stocks rallied at the open, as Dow Jones stock Intel (INTC) surged early on an analyst upgrade and price hike. Netflix (NFLX) staked out a big lead among rebounding FANG stocks. Alibaba Group Holding (BABA) and IPO Tencent Music (TME) led an early surge among China-based names.\n\nThe Nasdaq Composite was up 2.4% and climbing, as NetEase (NTES), Electronc Arts (EA) and Celgene (CELG) led the Nasdaq 100.\n\nThe Dow Jones industrial average and S&amp;P 500 each strengthened their opening gains to 2%. Intel easily topped the Dow. Varian Medical (VAR), CF Industries (CF) and Electronic Arts jockeyed for the top slot among S&amp;P 500 stocks.\n\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309268, "subreddit_type": "public", "thumbnail": "self", "title": "All index futures are +3%", "url": "https://www.reddit.com/r/stocks/comments/actp7h/all_index_futures_are_3/", "whitelist_status": "all_ads", "wls": 6}, {"author": "bigbear0083", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_eaak0", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546695077, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/acu5yz/get_ready_for_the_trading_week_beginning_january/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "acu5yz", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 29, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/acu5yz/get_ready_for_the_trading_week_beginning_january/", "pinned": false, "pwls": 6, "retrieved_on": 1546695078, "score": 1, "selftext": "Hey what's up r/stocks! Happy Saturday to all of you. I hope everyone on this sub made out pretty good last week amid all of the insane market volatility as of late, and are ready for the new trading week ahead! :)\n\nHere is everything you need to know to get you ready for the trading week beginning January 7th, 2019.\n\n# **Stock market comeback is now in the hands of China-US trade talks  - [(Source)](https://www.cnbc.com/2019/01/04/stock-market-comeback-is-now-in-the-hands-of-china-us-trade-talks.html)**\n*****\n&gt; Trade talks between the U.S.and China will dominate the market's focus in the week ahead, while investors are also watching to see whether other companies join the ranks of Apple and warn about an earnings miss.\n*****\n&gt; Fed Chairman Jerome Powell, who sent stocks sharply higher Friday, speaks again Thursday at an Economics Club of Washington D.C. luncheon. He is expected to deliver the same dovish message about flexibility when it comes to policy and patience when it comes to raising interest rates.\n*****\n&gt; Apple blamed a revenue miss in big part on a sudden drop off in iPhone sales in China in November. The hit was seen as a sign that not only are trade tensions hitting China's economy, but the U.S. economy and corporations could feel the pinch. Apple's comments came the day before a stunning drop in ISM manufacturing data which also was blamed in part on trade friction.\n*****\n&gt; \"What the market needs next week and the week after is positive guidance from companies. What are companies telling us? What are their customers telling us?\" said Quincy Krosby, chief market strategist at Prudential Financial. \"If we could move from a stellar earnings to a more moderate earnings backdrop, the market will accept that but if guidance is weak and companies are lowering revenue growth, that will affect the market.\"\n*****\n&gt; The S&amp;P 500 surged over 3.3 percent Friday to 2,531, and was up 1.7 percent for the week. The S&amp;P was up more than 7.5 percent from its Dec. 24 low close.\n*****\n&gt; China and the United States will hold vice ministerial level trade talks in Beijing on Monday and Tuesday and are expected to hold another round of meetings the following week.\n*****\n&gt; \"China is going to be absolutely the big thing,\" said Julian Emanuel, chief equities and derivatives strategist at BTIG. China cut reserve requirements Friday to encourage more bank lending, its latest policy move aimed at ending a slowdown.\n*****\n&gt; Economists expect U.S. growth to slow slightly, to the 2-2.5 percent range in the fist half but markets have been reacting to the prospect of an even slower economy. The ISM data for December was particularly discouraging because of a steep drop in new orders.\n*****\n&gt; \"The question is are we likely to have warnings? Given the economic data that we've seen, particularly the slowdown in the new orders component, we probably are likely to get warnings and the question is, is it baked into stock prices? We think, for the most part, it is,\" said Emanuel.\n*****\n&gt; Markets will also remain heavily focused on data after the weak ISM survey was followed by a surprisingly strong December jobs report with 312,000 nonfarm payrolls added. The employment report showed a strong labor market, with wage growth of 0.4 percent and a pickup in participation by more than 400,000 workers.\n*****\n&gt; \"What this market needed was a strong data release, an unequivocally strong data release,\" said Krosby. \"It was an injection to positive data in a market that has been worried about an economy that is potentially stalling,\"\n*****\n&gt; Krosby said the market needs to build on its gains and the positive sentiment around the strong data. \"This has been a market that had all of the signatures of the bear claws death by 1,000 cuts. No data release was seen as positive. Everything was seen as negative. If we could turn that psychology around and build on it, but we are waiting to see if there are sellers who were waiting to get out. We need to see if they're still there.\"\n*****\n&gt; Data releases in the comign week include Services ISM Monday and international trade data, out Tuesday morning, but the data the markets are waiting for will be Friday's CPI inflation report.\n*****\n&gt; During his appearance Friday, Powell indicated that inflation was not a concern for the Fed and the economy is still in good shape despite concerns. He also said the Fed was paying attention to the market, which is reflecting a weaker outlook than the data suggests.\n*****\n&gt; Powell also indicated the Fed can be \"patient\" and it will be flexible and willing to change policy if it sees changes in conditions. That comforted markets and sent stocks higher. Powell had said the Fed's balance sheet reduction program was on 'auto pilot' when he spoke in December, and that spooked some investors who wanted to see the Fed willing to modify its policy in the face of the market's sell off.\n*****\n&gt; \"Certainly, the market feels better about the fact that the Fed is moving towards its view on the hiking cycle. which is that it's largely over. From that perspective it decreases the possibility that the Fed is going to hike too far like it did in 2004 and 2006. It did in 2000 and it did in 1974, triggering broader stock market downturns and recessions,\" said Emanuel.\n*****\n&gt; \"That's makes people feel better and from our point of view that it makes it more likely that the technical bear market we've seen…is the likelihood that this going to be a shorter, shallower non-recessionary bear market,\" said Emanuel. The S&amp;P 500 has briefly visited a bear market, falling 20 percent from its all-time high on an intraday basis.\n*****\n&gt; Emanuel said the rally on the Fed was important since it had been a concern for the market.He expects the Fed to stay on hold this year and also announce that it will stop the roll off of its balance sheet by mid year.\n*****\n&gt; \"This reinforces the view the bulk of this bear market decline is behind us, and there's at least an expectation that communication between the U.S. and China is poised to improve rather than become more acrimonious over the course of the next few weeks,\" he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P HEAT MAP FOR THE PAST WEEK!](https://i.imgur.com/MMs5QHL.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/X7p14Gh.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/yIZxoHH.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/stjZBhj.png))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&amp;rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&amp;rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8GudEDd.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ADBljof.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/QwMSkFj.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/R4AcnzR.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/h7ATiV3.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!]())**\nNONE.\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR CHART LINK #1!](https://i.imgur.com/m5TQJNh.png))**\n###### **([CLICK HERE FOR CHART LINK #2!](https://i.imgur.com/9dL9iVu.png))**\n###### **([CLICK HERE FOR CHART LINK #3!](https://i.imgur.com/fKY5786.png))**\n\n*****\n\n# Why January is still the most important month\n\n&gt; Devised by Yale Hirsch in 1972, the January Barometer (JB) has registered ten major errors since 1950 for an 85.5% accuracy ratio. This indicator adheres to propensity that as the S&amp;P 500 goes in January, so goes the year. Of the ten major errors Vietnam affected 1966 and 1968. 1982 saw the start of a major bull market in August. Two January rate cuts and 9/11 affected 2001.The market in January 2003 was held down by the anticipation of military action in Iraq. The second worst bear market since 1900 ended in March of 2009 and Federal Reserve intervention influenced 2010 and 2014. In 2016, DJIA slipped into an official Ned Davis bear market in January. Last year, 2018, became the tenth major error overall and the seventh since 2001 as a hawkish Fed, a trade war and slowing global growth concerns resulted in the worst fourth quarter performance by S&amp;P 500 since 2008. Including the eight flat years yields a .739 batting average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/d4237535ede59fc7b779e5c862bc55ec/tumblr_inline_pkto8hrMOf1spdppr_640.jpg))**\n\n&gt; Let’s compare the January Barometer to all other “Monthly Barometers.” For the accompanying table we went back to 1938 for the S&amp;P 500 and DJIA — the year in which the January Barometer came to life — and back to 1971 for NASDAQ when that index took its current form.\n\n&gt; The accuracy ratios listed are based on whether or not the given month’s move — up or down — was followed by a move in the same direction for the whole period. For example, in the 81 years of data for the S&amp;P 500 for the January Barometer, 61 years moved in the same direction for 75.3% accuracy.\n\n&gt; The Calendar Year ratio is based on the month’s percent change and the whole year’s percent change; i.e., we compare December 2017’s percent change to the change for 2017 as a whole. By contrast the 11-month ratio compares the month’s move to the move of the following eleven months. February’s change is compared to the change from March to January. The 12-month change compares the month’s change to the following twelve months. February’s change is compared to the change from March to the next February.\n\n&gt; Though the January Barometer is based on the S&amp;P 500 we thought it would clear the air to look at the other two major averages as well. You can see for yourself in the table that no other month comes close to January in forecasting prowess over the longer term.\n\n&gt; There are a few interesting anomalies to point out though. On a calendar year basis DJIA in January is slightly better than the S&amp;P. 2011 is a perfect example of how the DJIA just edges out for the year while the S&amp;P does not. For NASDAQ April, September and November stick out as well on a calendar year basis, but these months are well into the year, and the point is to know how the year might pan out following January, not April, September or November. And no other month has any basis for being a barometer. January is loaded with reasons.\n\n&gt; Being the first month of the year it is the time when people readjust their portfolios, rethink their outlook for the coming year and try to make a fresh start. There is also an increase in cash that flows into the market in January, making market direction even more important. Then there is all the information Wall Street has to digest: The State of the Union Address, FOMC meeting, 4th quarter GDP, earnings and the plethora of other economic and market data.\n\n&gt; **Myths Dispelled**\n\n&gt; In recent years new myths and/or areas of confusion have come to light. One of the biggest errors is the notion that the January Barometer is a standalone indicator that can be used to base all of your investment decisions for the coming year on. This is simply not true and we have never claimed that the January Barometer should or could be used in this manner. The January Barometer is intended to be used in conjunction with all available data deemed relevant to either confirm or call into question your assessment of the market. No single indicator is 100% accurate so no single indicator should ever be considered in a vacuum. The January Barometer is not an exception to this.\n\n&gt; Another myth is that the January Barometer is completely useless. Those that believe this like to point out that simply expecting the market to be higher by the end of the year is just as accurate as the January Barometer. Statistically, they are just about right. In the 81-year history examined in this article, there were only 24 full-year declines. So yes, the S&amp;P 500 has posted annual gains 70.4% of the time since 1938. What is missing from this argument is the fact that when January was positive, the full year was also positive 86.0% of the time and when January was down the year was down 58.1% of the time. These are not the near perfect outcomes that true statisticians prefer, but once again, the January Barometer was not intended to be used in a vacuum.\n\n*****\n\n# Typical January Trading: Strength Early and That’s Been About It Recently\n\n&gt; Historically, the New Year has started out well with modest gains the first few trading days of January. Since 1980, DJIA has averaged a 0.30% gain on the first trading day of the year. S&amp;P 500 has averaged 0.21% and NASDAQ 0.22%. Similar to slightly better average gains have been observed on the second trading day of January, but after that consistent gains have become elusive. January’s performance over the more recent 21-year period has been rather lackluster. Strength is still present, on average, at the start of the month, but quickly fades after the second or third trading day. Afterwards, the trend is sideways to lower, a brief pause mid-month and then more sideways to lower trading through the end of the month. Weakness is most pronounced just after mid-month, beginning around the 12th trading day of January.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://66.media.tumblr.com/4a082e5b081e6a5576699ecedf3f313c/tumblr_inline_pkq9i7fqr11spdppr_500.jpg))**\n\n*****\n\n# Market Fears and Economic Realities\n\n&gt; Recent Federal Reserve (Fed) rhetoric has spooked financial markets, especially as uncertainty has clouded investors’ horizons. But we still believe the fundamental U.S. economic landscape is compelling, and despite market concerns, an important measure of market interest rates suggests that monetary policy remains accommodative.\n\n&gt; As shown in the LPL Chart of the Day, inflation-adjusted interest rates are still comparatively low and well below levels that historically have preceded economic recessions. Currently, the real fed funds rate sits at 0.3% (based on year-over-year core Consumer Price Index [CPI] growth of 2.2%), below the 1.3% real interest rate we’ve averaged since the end of 1970. During that same period, the real interest rate reached an average high of 4.2% before the U.S. economy entered a recession, significantly above where rates are today.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2019/01/Real-Interest-Rates.png?ssl=1))**\n\n&gt; “There is a disconnect between U.S. economic data and pessimism priced into financial markets,” said LPL Research Chief Investment Strategist John Lynch. “The U.S. economy is strong enough to operate at current rates, and we expect the Fed to be pragmatic and flexible enough to guide us to a soft landing.”\n\n&gt; This has been one of the most challenging market environments to navigate since the end of the Great Recession. However, we believe strong fundamentals are still in place, and the Fed’s plans remain supportive to the economic environment. While the uncertainty has been uncomfortable, the Fed remains data-dependent, leading us to expect two rate hikes in 2019.\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for January 4th, 2019** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET UP!)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.6.19** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NET YET UP!)\n\n*****\n\nHere are the most notable companies reporting earnings in this upcoming trading month ahead-\n\n*****\n\n&gt; * **$STZ**\n&gt; * **$BBBY** \n&gt; * **$SGH** \n&gt; * **$LEN** \n&gt; * **$KBH** \n&gt; * **$CMC** \n&gt; * **$FCEL** \n&gt; * **$HELE** \n&gt; * **$AYI** \n&gt; * **$AZZ** \n&gt; * **$LNN** \n&gt; * **$SCHN** \n&gt; * **$SNX** \n&gt; * **$MSM** \n&gt; * **$PLUG** \n&gt; * **$WDFC** \n&gt; * **$EXFO** \n&gt; * **$GBX** \n&gt; * **$PSMT** \n&gt; * **$SAR** \n&gt; * **$INFY** \n&gt; * **$FC** \n&gt; * **$NTIC** \n&gt; * **$KSHB** \n&gt; * **$VOXX** \n&gt; * **$SLP** \n&gt; * **$MPAA**\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/h7ATiV3.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/lXHlJt9.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.7.19 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/6PFIrQQ.png))\n\n&gt; # ***Monday 1.7.19 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n&gt; # ***Tuesday 1.8.19 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/2QJ9D7k.png))\n\n&gt; # ***Tuesday1.8.19 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ip0CK1r.png))\n\n*****\n\n&gt; # ***Wednesday 1.9.19 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/JXJYDNi.png))\n\n&gt; # ***Wednesday 1.9.19 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jjgvUFr.png))\n\n*****\n\n&gt; # ***Thursday 1.10.19 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/a3DgmVb.png))\n\n&gt; # ***Thursday 1.10.19 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pKEYxiL.png))\n\n*****\n\n&gt; # ***Friday 1.11.19 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/hbv0ZVb.png))\n\n*****\n\n&gt; # ***Friday 1.11.19 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\nNONE.\n\n*****\n\n# Amazon.com, Inc. - \n&gt; **Amazon.com, Inc. (AMZN)** is expected to report earnings at approximately 4:00 PM ET on Thursday, January 24, 2019. The consensus earnings estimate is $5.48 per share on revenue of $73.87 billion. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 153.70% with revenue increasing by 22.19%. Short interest has increased by 9.7% since the company's last earnings release while the stock has drifted lower by 16.5% from its open following the earnings release to be 18.8% below its 200 day moving average of $1,695.41. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.3% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Constellation Brands, Inc. $166.62 \n&gt; **Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, January 9, 2019. The consensus earnings estimate is $2.04 per share on revenue of $1.91 billion and the Earnings Whisper ® number is $2.08 per share. Investor sentiment going into the company's earnings release has 58% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 2.00% with revenue decreasing by 3.48%. Short interest has decreased by 3.4% since the company's last earnings release while the stock has drifted lower by 25.7% from its open following the earnings release to be 21.1% below its 200 day moving average of $211.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, December 28, 2018 there was some notable buying of 6,862 contracts of the $145.00 put expiring on Friday, January 18, 2019. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 4.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Bed Bath &amp; Beyond, Inc. $11.95 \n&gt; **Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, January 9, 2019. The consensus earnings estimate is $0.17 per share on revenue of $3.04 billion and the Earnings Whisper ® number is $0.17 per share. Investor sentiment going into the company's earnings release has 33% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 61.36% with revenue increasing by 2.89%. Short interest has increased by 9.7% since the company's last earnings release while the stock has drifted lower by 22.0% from its open following the earnings release to be 28.9% below its 200 day moving average of $16.82. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, January 4, 2019 there was some notable buying of 17,391 contracts of the $30.00 call expiring on Friday, February 15, 2019. Option traders are pricing in a 18.2% move on earnings and the stock has averaged a 14.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# SMART Global Holdings, Inc. $29.65 \n&gt; **SMART Global Holdings, Inc. (SGH)** is confirmed to report earnings at approximately 4:20 PM ET on Tuesday, January 8, 2019. The consensus earnings estimate is $1.77 per share on revenue of $382.24 million and the Earnings Whisper ® number is $1.79 per share. Investor sentiment going into the company's earnings release has 70% expecting an earnings beat The company's guidance was for earnings of $1.74 to $1.79 per share on revenue of $375.00 million to $390.00 million. Consensus estimates are for year-over-year earnings growth of 70.19% with revenue increasing by 44.02%. Short interest has increased by 22.1% since the company's last earnings release while the stock has drifted lower by 8.4% from its open following the earnings release to be 16.2% below its 200 day moving average of $35.38. On Friday, December 28, 2018 there was some notable buying of 1,014 contracts of the $40.00 call expiring on Friday, January 18, 2019. Option traders are pricing in a 21.0% move on earnings and the stock has averaged a 14.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SGH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# KB Home $20.66 \n&gt; **KB Home (KBH)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, January 9, 2019. The consensus earnings estimate is $0.93 per share on revenue of $1.35 billion and the Earnings Whisper ® number is $0.97 per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 10.71% with revenue decreasing by 3.79%. Short interest has decreased by 10.2% since the company's last earnings release while the stock has drifted lower by 22.7% from its open following the earnings release to be 15.3% below its 200 day moving average of $24.39. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KBH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Lennar Corp. $41.21 \n&gt; **Lennar Corp. (LEN)** is confirmed to report earnings at approximately 6:00 AM ET on Wednesday, January 9, 2019. The consensus earnings estimate is $1.93 per share on revenue of $6.53 billion and the Earnings Whisper ® number is $1.96 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 49.61% with revenue increasing by 72.50%. Short interest has decreased by 0.3% since the company's last earnings release while the stock has drifted lower by 11.3% from its open following the earnings release to be 16.9% below its 200 day moving average of $49.60. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, December 31, 2018 there was some notable buying of 4,101 contracts of the $50.00 call expiring on Friday, January 18, 2019. Option traders are pricing in a 7.1% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Commercial Metals Company $17.04 \n&gt; **Commercial Metals Company (CMC)** is confirmed to report earnings at approximately 6:45 AM ET on Monday, January 7, 2019. The consensus earnings estimate is $0.38 per share on revenue of $1.27 billion and the Earnings Whisper ® number is $0.36 per share. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 26.67% with revenue increasing by 2.54%. Short interest has decreased by 3.3% since the company's last earnings release while the stock has drifted lower by 4.8% from its open following the earnings release to be 19.3% below its 200 day moving average of $21.11. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 7.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CMC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# FuelCell Energy, Inc. $0.56 \n&gt; **FuelCell Energy, Inc. (FCEL)** is confirmed to report earnings at approximately 8:00 AM ET on Thursday, January 10, 2019. The consensus estimate is for a loss of $0.17 per share on revenue of $15.93 million. Investor sentiment going into the company's earnings release has 52% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 0.00% with revenue decreasing by 66.74%. Short interest has increased by 19.8% since the company's last earnings release while the stock has drifted lower by 50.3% from its open following the earnings release to be 59.4% below its 200 day moving average of $1.37. Overall earnings estimates have been revised lower since the company's last earnings release. The stock has averaged a 5.4% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FCEL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Helen of Troy Ltd. $133.95 \n&gt; **Helen of Troy Ltd. (HELE)** is confirmed to report earnings at approximately 6:45 AM ET on Tuesday, January 8, 2019. The consensus earnings estimate is $2.16 per share on revenue of $420.20 million. Investor sentiment going into the company's earnings release has 42% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.11% with revenue decreasing by 7.25%. Short interest has decreased by 29.6% since the company's last earnings release while the stock has drifted higher by 3.3% from its open following the earnings release to be 19.3% above its 200 day moving average of $112.30. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HELE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# Acuity Brands, Inc. $116.67 \n&gt; **Acuity Brands, Inc. (AYI)** is confirmed to report earnings at approximately 9:05 AM ET on Wednesday, January 9, 2019. The consensus earnings estimate is $2.18 per share on revenue of $931.72 million and the Earnings Whisper ® number is $2.09 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 12.95% with revenue increasing by 10.55%. Short interest has decreased by 57.6% since the company's last earnings release while the stock has drifted lower by 20.7% from its open following the earnings release to be 9.6% below its 200 day moving average of $129.08. On Monday, December 31, 2018 there was some notable buying of 509 contracts of the $85.00 put expiring on Friday, January 18, 2019. Option traders are pricing in a 7.1% move on earnings and the stock has averaged a 10.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AYI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# AZZ Inc. $40.90 \n&gt; **AZZ Inc. (AZZ)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, January 8, 2019. The consensus earnings estimate is $0.61 per share on revenue of $241.80 million. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6,200.00% with revenue increasing by 16.16%. Short interest has decreased by 10.6% since the company's last earnings release while the stock has drifted lower by 8.4% from its open following the earnings release to be 13.4% below its 200 day moving average of $47.23. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 9.5% move on earnings and the stock has averaged a 8.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week ahead?\n\n*****\n\nHave a fantastic weekend and trading week ahead r/stocks! :)", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309282, "subreddit_type": "public", "thumbnail": "self", "title": "Get ready for the trading week beginning January 7th, 2019!", "url": "https://www.reddit.com/r/stocks/comments/acu5yz/get_ready_for_the_trading_week_beginning_january/", "whitelist_status": "all_ads", "wls": 6}, {"author": "KopiousKarp", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2v5vmryu", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546741116, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ad18bx/trying_to_pull_out_with_small_loss/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "ad18bx", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 18, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ad18bx/trying_to_pull_out_with_small_loss/", "pinned": false, "pwls": 6, "retrieved_on": 1546741117, "score": 1, "selftext": "New to investing. I opened a little account with Acorns in August. After watching my measly $1005 drop by 15% over the holidays I'm seeing it come back and sit at -10%. \nI keep hearing that we're in for a world of trouble with Brexit and the rising interest rates. So here's my question.\n\nShould I keep waiting for it to go up, or pull out now and cut my losses?\n\nThe way Acorns is set up, I don't have much control over what I have stocks in. Currently my portfolio is:\nAgressive\n1.6 shares in \"large company stocks\"\n1.3 shares in \"small company stocks\"\n2.4 shares in \"emerging market stocks\"\n1.26 shares in \"real estate stocks\" \n4.8 shares in \"Intl Large company stocks\" \n$1005 invested ::  $909 current value \n\nAny input will be much appreciated. \n\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309487, "subreddit_type": "public", "thumbnail": "self", "title": "Trying to pull out with small loss", "url": "https://www.reddit.com/r/stocks/comments/ad18bx/trying_to_pull_out_with_small_loss/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Savilo29", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_slus2", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546667371, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/acrc9f/can_you_exercise_a_call_option_long_before_the/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "acrc9f", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/acrc9f/can_you_exercise_a_call_option_long_before_the/", "pinned": false, "pwls": 6, "retrieved_on": 1546667372, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309200, "subreddit_type": "public", "thumbnail": "self", "title": "Can you exercise a call option long before the expiration date?", "url": "https://www.reddit.com/r/stocks/comments/acrc9f/can_you_exercise_a_call_option_long_before_the/", "whitelist_status": "all_ads", "wls": 6}, {"author": "FunctionOfLife", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2sb7ijmb", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546698522, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/acukda/long_term_macroeconomic_data_displayed_in_chart/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "acukda", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/acukda/long_term_macroeconomic_data_displayed_in_chart/", "pinned": false, "pwls": 6, "retrieved_on": 1546698523, "score": 1, "selftext": "Data for stock, market indexes, metals, energy, commodities, interest rates and the economy in graph chart. Enjoy.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309290, "subreddit_type": "public", "thumbnail": "self", "title": "Long term macroeconomic data displayed in chart form. Perhaps you guys will find the website useful and informative. Macro trends.net.", "url": "https://www.reddit.com/r/stocks/comments/acukda/long_term_macroeconomic_data_displayed_in_chart/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Evy1983", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_nh2nfhr", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546704144, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/acvbek/sono_calls/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "acvbek", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/acvbek/sono_calls/", "pinned": false, "pwls": 6, "retrieved_on": 1546704144, "score": 1, "selftext": "Im talking myself into some Feb 15th $12.5 SONO calls. \n\nWith CES this week and earnings scheduled for 02/11... \n\nThis might be a bonehead move but I'm feeling it but figured I'd bounce it off people that have more experience before pulling the trigger Monday ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309320, "subreddit_type": "public", "thumbnail": "self", "title": "$Sono calls?", "url": "https://www.reddit.com/r/stocks/comments/acvbek/sono_calls/", "whitelist_status": "all_ads", "wls": 6}, {"author": "teamfreddy", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_pw5zt", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546735024, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/ad0at2/thoughts_on_pier1_stock/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "ad0at2", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 13, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/ad0at2/thoughts_on_pier1_stock/", "pinned": false, "pwls": 6, "retrieved_on": 1546735025, "score": 1, "selftext": "Been thinking of rolling the dice on a few shares.... hoping they can turn things around. Has anyone thought about PIR and what are your thoughts? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309466, "subreddit_type": "public", "thumbnail": "self", "title": "Thoughts On Pier1 stock...", "url": "https://www.reddit.com/r/stocks/comments/ad0at2/thoughts_on_pier1_stock/", "whitelist_status": "all_ads", "wls": 6}, {"author": "PlaySenseMe", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_gd2ydix", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1546710929, "domain": "self.stocks", "full_link": "https://www.reddit.com/r/stocks/comments/acwdna/for_daily_trading/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "acwdna", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 23, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/stocks/comments/acwdna/for_daily_trading/", "pinned": false, "pwls": 6, "retrieved_on": 1546710930, "score": 1, "selftext": "What kind of strategies you have? Should I check Daily, hourly 15 or 5 minutes indicators? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "stocks", "subreddit_id": "t5_2qjfk", "subreddit_subscribers": 309354, "subreddit_type": "public", "thumbnail": "self", "title": "For daily trading...", "url": "https://www.reddit.com/r/stocks/comments/acwdna/for_daily_trading/", "whitelist_status": "all_ads", "wls": 6}]